// centerTooltip.js
import { ref } from 'vue';

export const setTooltipList = (dynamicList) => {
  console.log(dynamicList, 'dynamicList')
  return ref({
    // 交流配电柜
    ACDC: [
      { name: 'A相电流', value: dynamicList.currentA??'--', unit: "A" },
      { name: 'B相电流', value: dynamicList.currentB??'--', unit: "A" },
      { name: 'C相电流', value: dynamicList.currentC??'--', unit: "A" },
      { name: '有功功率', value: dynamicList.power ?? '--', unit: "kW" },
      // { name: '总电流', value: '', unit: "A" }
    ],
    // 直流母线柜
    ACBC: [
      { name: '电压', value: dynamicList.voltage ?? '--', unit: "V" },
      { name: '电流', value: dynamicList.current ?? '--', unit: "A" },
      { name: '功率', value: dynamicList.power ?? '--', unit: "kW" },
      { name: '运行模式', value: dynamicList.runModeName ?? '--', }],
    // 光伏阵列
    PVA: [
      { name: '母线电压', value: dynamicList.busVoltage ?? '--', unit: 'V' },
      { name: '母线电流', value: dynamicList.busCurrent ?? '--', unit: 'A' },
      { name: 'MPPT电压', value: dynamicList.mpptVoltage ?? '--', unit: 'V' },
      { name: '功率', value: dynamicList.power ?? '--', unit: 'kW' },
      { name: '当日发电量', value: dynamicList.dayQt ?? '--', unit: 'kWh' }
    ],
    // 储能柜（ESC）数据结构
    ESC: [
      {
        name: "储能DC/DC",
        children: [
          { name: '功率', value: dynamicList.power ?? '--', unit: 'kW' },
          { name: '母线电流', value: dynamicList.busCurrent ?? '--', unit: 'A' },
          { name: '母线电压', value: dynamicList.busVoltage ?? '--', unit: 'V' },

        ]
      }, {
        name: "储能电池蔟",
        children: [
          { name: 'SOC', value: dynamicList.soc ?? '--', unit: '%' },
          { name: '电池总电压', value: dynamicList.batteryVoltage ?? '--', unit: 'V' },
          { name: '电池总电流', value: dynamicList.batteryCurrent ?? '--', unit: 'A' },
          { name: '运行模式', value: dynamicList.runModeName ?? '--', unit: '' },
          { name: '最高单体电压', value: dynamicList.maxVoltage ?? '--', unit: 'mV' },
          { name: '最低单体电压', value: dynamicList.minVoltage ?? '--', unit: 'mV' },
          { name: '最高单体温度', value: dynamicList.maxTemp ?? '--', unit: '℃' },
          { name: '最低单体温度', value: dynamicList.minTemp ?? '--', unit: '℃' }
        ]
      }
    ],
    DCDC: [
      { name: '电压', value: dynamicList.voltage ?? '--', unit: 'V' },
      { name: '电流', value: dynamicList.current ?? '--', unit: 'A' },
      { name: '功率', value: dynamicList.power ?? '--', unit: 'kW' }
    ]

  });
};

export const setTooltipList2 = (dynamicList) => {
  return {
    '注塑机MA1600V': [
      {
        name: "合模单元",
        children: [
          { name: '锁模力', value: 1600, unit: 'kN' },
          { name: '移模行程', value: 430, unit: 'mm' },
          { name: '最小模厚', value: 180, unit: 'mm' },
          { name: '最大模厚', value: 520, unit: 'mm' },
          { name: '拉杆内间距(H×V)', value: '470×470', unit: 'mm' },
          { name: '顶出行程', value: 140, unit: 'mm' },
          { name: '顶出力', value: 33, unit: 'kN' },
        ]
      }, {
        name: "注射单元",
        children: [
          { name: '螺杆直径', value: { A: 40, B: 45, C: 50 }, unit: 'mm' },
          { name: '螺杆长径比', value: { A: 22.5, B: 20, C: 18 }, unit: 'L/D' },
          { name: '注射容量(理论)', value: { A: 252, B: 319, C: 394 }, unit: 'cm³' },
          { name: '注射重量(PS)', value: { A: 229, B: 290, C: 359 }, unit: 'g' },
          { name: '注射速率(PS)', value: { A: 131, B: 166, C: 205 }, unit: 'g/s' },
          { name: '注射速率(增速)', value: { A: 144, B: 183, C: 226 }, unit: 'g/s' },
          { name: '注射压力', value: { A: 239, B: 189, C: 153 }, unit: 'MPa' },
          { name: '塑化能力(GPPS)', value: { A: 21.0, B: 27.9, C: 35.0 }, unit: 'g/s' },
          { name: '塑化能力(HDPE)', value: { A: '-', B: '-', C: '-' }, unit: 'g/s' },
          { name: '螺杆转速', value: { A: 285, B: 285, C: 285 }, unit: 'rpm' }
        ]
      }, {
        name: '其他',
        children: [
          { name: '油泵马达', value: 22, unit: 'kW' },
          { name: '电热功率', value: 12.85, unit: 'kW' },
          { name: '外型尺寸(L×W×H)', value: '5.59×1.33×1.96', unit: 'm' },
          { name: '机器重量', value: 5.0, unit: 't' },
          { name: '料斗容积(选配)', value: 25, unit: 'kg' },
          { name: '油箱容积', value: 165, unit: 'l' },
        ]
      }
    ],
    '注塑机VE1500V': [{
      name: "合模单元",
      children: [
        { name: '合模力', value: 1500, unit: 'kN' },
        { name: '最大移模行程', value: 420, unit: 'mm' },
        { name: '最小模厚', value: 180, unit: 'mm' },
        { name: '最大模厚', value: 520, unit: 'mm' },
        { name: '最大模板开距', value: 940, unit: 'mm' },
        { name: '拉杆内间距(H×V)', value: '520×520', unit: 'mm' },
        { name: '模板尺寸(H×V)', value: '740×740', unit: 'mm' },
        { name: '最小模具尺寸', value: '335×335', unit: 'mm' },
        { name: '顶出行程', value: 120, unit: 'mm' },
        { name: '顶出力', value: 34.3, unit: 'kN' }
      ]

    },
    {
      name: "注射单元",
      children: [
        // 1. 螺杆直径
        {
          name: "螺杆直径",
          unit: "mm",
          value: {
            "210-AA": 26, "210-A": 28, "210-B": 32, "210-C": 36,
            "300-AA": 30, "300-A": 32, "300-B": 36, "300-C": 40,
            "430-A": 36, "430-B": 40, "430-C": 45,
            "640-A": 40, "640-B": 45, "640-C": 50
          }
        },
        // 2. 螺杆长径比
        {
          name: "螺杆长径比",
          unit: "L/D",
          value: {
            "210-AA": 21, "210-A": 21, "210-B": 21, "210-C": 18.6,
            "300-AA": 21, "300-A": 22.5, "300-B": 20, "300-C": 18,
            "430-A": 23.3, "430-B": 21, "430-C": 18.7,
            "640-A": 22.5, "640-B": 20, "640-C": 18
          }
        },
        // 3. 注射容量(理论)
        {
          name: "注射容量(理论)¹",
          unit: "cm³",
          value: {
            "210-AA": 61, "210-A": 70, "210-B": 100, "210-C": 127,
            "300-AA": 102, "300-A": 116, "300-B": 147, "300-C": 182,
            "430-A": 173, "430-B": 213, "430-C": 270,
            "640-A": 252, "640-B": 319, "640-C": 394
          }
        },
        // 4. 注射重量(PS)
        {
          name: "注射重量(PS)²",
          unit: "g",
          value: {
            "210-AA": 55, "210-A": 64, "210-B": 91, "210-C": 115,
            "300-AA": 92, "300-A": 106, "300-B": 134, "300-C": 165,
            "430-A": 157, "430-B": 194, "430-C": 246,
            "640-A": 229, "640-B": 290, "640-C": 358
          }
        },
        // 5. 注射压力(MPa)
        {
          name: "注射压力³",
          unit: "MPa",
          value: {
            "210-AA": 280, "210-A": 260, "210-B": 200, "210-C": 160,
            "300-AA": 280, "300-A": 253, "300-B": 200, "300-C": 162,
            "430-A": 247, "430-B": 200, "430-C": 158,
            "640-A": 253, "640-B": 200, "640-C": 162
          }
        },
        // 6. 注射压力(kgf/cm²)
        {
          name: "注射压力³",
          unit: "kgf/cm²",
          value: {
            "210-AA": 2850, "210-A": 2650, "210-B": 2040, "210-C": 1630,
            "300-AA": 2850, "300-A": 2580, "300-B": 2040, "300-C": 1650,
            "430-A": 2520, "430-B": 2040, "430-C": 1610,
            "640-A": 2580, "640-B": 2040, "640-C": 1650
          }
        },
        // 7. 保压压力(MPa)
        {
          name: "保压压力³",
          unit: "MPa",
          value: {
            "210-AA": 224, "210-A": 206, "210-B": 160, "210-C": 126,
            "300-AA": 224, "300-A": 202, "300-B": 160, "300-C": 130,
            "430-A": 197, "430-B": 160, "430-C": 126,
            "640-A": 202, "640-B": 160, "640-C": 130
          }
        },
        // 8. 保压压力(kgf/cm²)
        {
          name: "保压压力³",
          unit: "kgf/cm²",
          value: {
            "210-AA": 2280, "210-A": 2100, "210-B": 1630, "210-C": 1280,
            "300-AA": 2280, "300-A": 2060, "300-B": 1630, "300-C": 1320,
            "430-A": 2010, "430-B": 1630, "430-C": 1280,
            "640-A": 2060, "640-B": 1630, "640-C": 1320
          }
        },
        // 9. 螺杆转速
        {
          name: "螺杆转速",
          unit: "rpm",
          value: {
            "210": 400, "300": 400, "430": 400, "640": 350
          }
        },
        // 10. 塑化能力(GPPS)
        {
          name: "塑化能力(GPPS)⁴",
          unit: "g/s",
          value: {
            "210-AA": 8.5, "210-A": 11, "210-B": 16, "210-C": 19.4,
            "300-AA": 13.3, "300-A": 16.6, "300-B": 20.1, "300-C": 27.7,
            "430-A": 22, "430-B": 30, "430-C": 42,
            "640-A": 27, "640-B": 39, "640-C": 50
          }
        },
        // 11. 喷嘴接触力
        {
          name: "喷嘴接触力",
          unit: "kN",
          value: {
            "210": 19.6, "300": 24.5, "430": 29.4, "640": 39.2
          }
        },
        // 12. 注射单元型号(标准)
        {
          name: "注射单元型号",
          unit: "",
          value: {
            "210": "210", "300": "300", "430": "430", "640": "640"
          }
        },
        // 13. 注射速度(标准)
        {
          name: "注射速度",
          unit: "mm/s",
          value: {
            "210": 200, "300": 200, "430": 200, "640": 160
          }
        },
        // 14. 注射速率(PS,标准)
        {
          name: "注射速率(PS)⁵",
          unit: "g/s",
          value: {
            "210-AA": 92, "210-A": 107, "210-B": 140, "210-C": 177,
            "300-AA": 123, "300-A": 140, "300-B": 177, "300-C": 219,
            "430-A": 177, "430-B": 219, "430-C": 277,
            "640-A": 175, "640-B": 222, "640-C": 274
          }
        },
        // 15. 注射单元型号(高速)
        {
          name: "注射单元型号",
          unit: "",
          value: {
            "210": "210h", "300": "300h", "430": "430h", "640": "640h"
          }
        },
        // 16. 注射速度(高速)
        {
          name: "注射速度",
          unit: "mm/s",
          value: {
            "210": 350, "300": 300, "430": 300, "640": 250
          }
        },
        // 17. 注射速率(PS,高速)
        {
          name: "注射速率(PS)⁵",
          unit: "g/s",
          value: {
            "210-AA": 162, "210-A": 188, "210-B": 245, "210-C": 311,
            "300-AA": 185, "300-A": 210, "300-B": 266, "300-C": 329,
            "430-A": 266, "430-B": 329, "430-C": 416,
            "640-A": 274, "640-B": 347, "640-C": 428
          }
        },
        // 18. 注射单元型号(超高速)
        {
          name: "注射单元型号",
          unit: "",
          value: {
            "210": "210hs", "300": "300hs", "430": "430hs", "640": "640hs"
          }
        },
        // 19. 注射速度(超高速)
        {
          name: "注射速度",
          unit: "mm/s",
          value: {
            "210": 500, "300": 500, "430": 500, "640": 350
          }
        },
        // 20. 注射速率(PS,超高速)
        {
          name: "注射速率(PS)⁵",
          unit: "g/s",
          value: {
            "210-AA": 231, "210-A": 268, "210-B": 351, "210-C": 444,
            "300-AA": 308, "300-A": 351, "300-B": 444, "300-C": 548,
            "430-A": 444, "430-B": 548, "430-C": 694,
            "640-A": 384, "640-B": 486, "640-C": 600
          }
        }
      ]


    },
    {
      "name": "其他",
      "children": [
        {
          "name": "总电器容量",
          "unit": "kW/A",
          "value": {
            "210": "210:16/26 \n 210h:21/36 \n 210hs:29/48",
            "300": "300:20/34 \n 300h:26/43 \n 300hs:37/61",
            "430": "430:27/45 \n 430h:31/52 \n 430hs:48/81",
            "640": "640:28/47 \n 640h:32/53 \n 640hs:49/82"
          }
        },
        {
          "name": "电热功率",
          "unit": "kW",
          "value": {
            "210-AA": 6.9,
            "210-A": 7.8,
            "210-B": 9.2,
            "210-C": 9.2,
            "300-AA": 10.3,
            "300-A": 11.9,
            "300-B": 11.9,
            "300-C": 11.9,
            "430-A": 13.5,
            "640-A": 14.8
          }
        },
        {
          "name": "外形(L×W×H)",
          "unit": "m",
          "value": {
            "210": "5.26×1.41×2.21",
            "300": "5.26×1.41×2.21",
            "430": "5.58×1.41×2.21",
            "640": "5.71×1.41×2.21"
          }
        },
        {
          "name": "机器重量",
          "unit": "t",
          "value": {
            "210": 5.80,
            "300": 6.00,
            "430": 6.30,
            "640": 6.35
          }
        },
        {
          "name": "料斗容积(选配)",
          "unit": "l",
          "value": {
            "210": 25,
            "300": 25,
            "430": 25,
            "640": 25
          }
        }
      ]
    }
    ],
    '注塑机JU5500V': [
      {
        name: "合模单元",
        children: [
          { name: '锁模力', value: 5500, unit: 'kN' },
          { name: '移模行程', value: '1300/750', unit: 'mm' },
          { name: '最小模厚', value: 350, unit: 'mm' },
          { name: '最大模厚', value: 900, unit: 'mm' },
          { name: '最大模板开距', value: 1650, unit: 'mm' },
          { name: '拉杆内间距(H×V)', value: '920×830', unit: 'mm' },
          { name: '顶出行程', value: 250, unit: 'mm' },
          { name: '顶出力', value: 110, unit: 'kN' },
          { name: '最大模具重量', value: 8, unit: 't' }
        ]
      }, {
        name: "注射单元",
        children: [
          {
            name: '螺杆直径',
            unit: 'mm',
            value: {
              '2250-A': 65, '2250-B': 70, '2250-C': 75,
              '3450-A': 70, '3450-B': 80, '3450-C': 85,
              '4550-A': 80, '4550-B': 85, '4550-C': 90
            }
          },
          {
            name: '螺杆长径比',
            unit: 'L/D',
            value: {
              '2250-A': 21.5, '2250-B': 20, '2250-C': 18.7,
              '3450-A': 22.9, '3450-B': 20, '3450-C': 19.1,
              '4550-A': 23.4, '4550-B': 22, '4550-C': 20.8
            }
          },
          {
            name: '注射容量(理论)',
            unit: 'cm³',
            value: {
              '2250-A': 1068, '2250-B': 1239, '2250-C': 1422,
              '3450-A': 1423, '3450-B': 1859, '3450-C': 2099,
              '4550-A': 2211, '4550-B': 2496, '4550-C': 2799
            }
          },
          {
            name: '注射重量(PS)',
            unit: 'g',
            value: {
              '2250-A': 972, '2250-B': 1127, '2250-C': 1294,
              '3450-A': 1295, '3450-B': 1692, '3450-C': 1910,
              '4550-A': 2012, '4550-B': 2272, '4550-C': 2547
            }
          },
          {
            name: '注射速率(PS)',
            unit: 'g/s',
            value: {
              '2250-A': 372, '2250-B': 431, '2250-C': 495,
              '3450-A': 402, '3450-B': 525, '3450-C': 593,
              '4550-A': 525, '4550-B': 593, '4550-C': 665
            }
          },
          {
            name: '注射压力',
            unit: 'MPa',
            value: {
              '2250-A': 182, '2250-B': 157, '2250-C': 137,
              '3450-A': 208, '3450-B': 159, '3450-C': 141,
              '4550-A': 181, '4550-B': 160, '4550-C': 143
            }
          },
          {
            name: '注射压力(最高)',
            unit: 'MPa',
            value: {
              '2250-A': 212, '2250-B': 183, '2250-C': 159,
              '3450-A': 239, '3450-B': 183, '3450-C': 162,
              '4550-A': 208, '4550-B': 185, '4550-C': 165
            }
          },
          {
            name: '塑化能力(GPPS)',
            unit: 'g/s',
            value: {
              '2250-A': 62.0, '2250-B': 71.1, '2250-C': 80.4,
              '3450-A': 69.8, '3450-B': 82.6, '3450-C': 101.0,
              '4550-A': 80.2, '4550-B': 88.7, '4550-C': 101.0
            }
          },
          {
            name: '塑化能力(HDPE)',
            unit: 'g/s',
            value: {
              '2250-A': 93.5, '2250-B': 111.4, '2250-C': 124.6,
              '3450-A': 105.1, '3450-B': 132, '3450-C': 159.7,
              '4550-A': 119.7, '4550-B': 132.9, '4550-C': 150.2
            }
          },
          {
            name: '螺杆转速',
            unit: 'rpm',
            value: {
              '2250-A': 240, '2250-B': 240, '2250-C': 240,
              '3450-A': 220, '3450-B': 220, '3450-C': 220,
              '4550-A': 200, '4550-B': 200, '4550-C': 200
            }
          }
        ]
      }, {
        name: "其他",
        children: [
          { name: '油泵马达', value: { "2250": 55, "3450": 65, "4650": 75 }, unit: 'kW' },
          { name: '电热功率', value: { "2250": 32, "3450": 38, "4650": 48 }, unit: 'kW' },
          { name: '外型尺寸(L×W×H)', value: { "2250": '7.04×2.35×2.60', "3450": '7.46×2.35×2.60', "4650": '7.93×2.35×2.60' }, unit: 'm' },
          { name: '机器重量', value: { "2250": 21, "3450": 22, "4650": 23 }, unit: 't' },
          { name: '料斗容积(选配)', value: { "2250": 50, "3450": 50, "4650": 100 }, unit: 'kg' },
          { name: '油箱容积', value: { "2250": 430, "3450": 430, "4650": 510 }, unit: 'l' }
        ]
      }
    ]
  }
}